Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ད་ལྟ ར་ ང་ ཁྱེད་ཅག་ གི་ ཐེ་ཚོམ་ གཅོད་པ ར་ བྱེད་པ་ དང་ །_ དེ འི་ ཚེ་ ཆོས་ སྨྲ་བ་ ཆོས་ ཡོངས་སུ་ འཛིན་པ །_ ཆོས་སྟོན་པ །_ དོན་ དུ་ གཉེར་བ །_ མདོ་སྡེ་ དེ་ལྟ་ བུ་ འཛིན་པ་ གང་དག་ འབྱུང་བ ར་ འགྱུར་བ་ དེ་དག་ ལ་ ཡང་ དེ འི་ ཚེ་ ང་ ཆོས་ ཀྱི་ ཐེ་ཚོམ་ དེ་ལྟ་ བུ་ གཅོད་པ ར་ བྱེད་པ་ དེ་ ལ་ ལྟོས་ ཤིག _།
en: Śāradvatī­putra, now I have resolved your doubts, so you can trust that I will also resolve such doubts about the Dharma for those Dharma preachers in the future who receive the Dharma, seek Dharma teachers, and uphold such sūtras.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཐམས་ཅད་ མཁྱེན་པ་ ཡིན་ ཞིང་ །_ ཐམས་ཅད་ ཤེས་པ་ ཅན་ ཡིན །_ ཐམས་ཅད་ གཟིགས་པ་ ཡིན །_ |#| ཐམས་ཅད་ སྟོན་པ་ ཡིན་ ནོ །_།
en: $1518 “Śāradvatī­putra, a thus-gone one knows all, has knowledge of all, sees all, and teaches all.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གང་དེ་ བཞིན་ གཤེགས་པ ས་ མ་ མཁྱེན་ མ་ གཟིགས་ མ་ གསན་པ འི་ ཆོས་ དེ་ ནི་ མེད་ དོ །_།
en: Śāradvatī­putra, there is no Dharma that a thus-gone one has not known, seen, or heard.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ དུས་གསུམ་ ལ་མ་ ཐོགས་པ འི་ ཡེ་ཤེས་ བརྙེས་པ་ ཡིན་ ཞིང་ །_
en: Śāradvatī­putra, a thus-gone one has acquired wisdom that is unimpeded throughout the three times.

source: མ་ཆགས་པ་ དང་ གྲོལ་བ་ ཡིན །_
en: He is unobstructed and free.

source: དབང་ དུ་ གྱུར་པ་ དང་ །_ ཉོན་མོངས་པ་ མེད་པ་ ཡིན །_
en: He has reached mastery and has no afflictions.

source: རང་ འབྱུང་ ཡིན །_
en: He is self-arisen.

source: སློབ་དཔོན་ མི་ མངའ་བ་ ཡིན །_
en: He has no teacher.

source: བདེ་བླག་ ཏུ་ སེང་གེ འི་ སྒྲ་ སྒྲོགས་པ་ ཡིན་ ནོ །_།
en: He proclaims the lion’s roar with ease.

source: !ཤ་ར་དྭ་ཏི འི་ བུ་ ཡང་ མི་ བླུན་པོ་ དེ་དག་ གི་ སྤྱོད་པ་ དང་ །_ སྤྱོད་ཡུལ་ དང་ །_ ལམ་ གྱིས་ ནི་ མཆོག་ གོ །_།
en: $1519 “Śāradvatī­putra, moreover, those fools are content#75 with their conduct, purview, and path.

source: དེ་དག་ ནི་ མ་ བསླབས་པ་ ཡིན །_
en: They are not trained.

source: མི་ བླུན་པོ་ དེ་དག་ ནི་ ལམ་ངན་ པར་ ཞུགས་ པར་ འགྱུར་བ་ ཡིན་ ནོ །_།
en: Those fools will embark on the wrong path.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ལྟ་བས་ན །_ |#| རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ལ་ མངོན་པར་ ཡང་དག་ པར་ ཞུགས་ པས་ ནི་ བདག་ སངས་ རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ལ་ མངོན་པར་ མ་ དད་ ཅིང་ །_ ཉེས་པ ར་ མ་ བརྟགས་ ལ་ མངོན་པར་ རྫོགས་པ ར་ སངས་ མ་ རྒྱས་ ན་ |#| མི་ རུང་ ངོ་ སྙམ་ ནས་ |#| ཆོས་ དེ་ལྟ་ བུ་ དེ་དག་ ལ་ འདུན་པ ར་ བྱ །_ |#| རྣལ་འབྱོར་ དུ་ བྱ །_ |#| སྤྲོ་བ ར་ བྱ འོ །_།
en: Śāradvatī­putra, it is for this reason that a son or daughter of noble family who has perfectly set out for unexcelled and perfect awakening should aspire for, practice, and delight in such qualities, with the thought, ‘It would not be right for me to lack strong faith in the awakening of the blessed ones and, by not considering this lack as faulty, fail to fully awaken.’

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ ཆོས་ བཞི་ དང་ ལྡན་ ན །_ |#| སངས་རྒྱས་ ཀྱི་ བྱང་ཆུབ་ སྤོང་བ ར་ བྱེད་པ་ ཡིན་ ཏེ །_
en: $1520 “Śāradvatī­putra, there are four factors which, if noble sons and daughters possess them, will cause them to abandon the awakening of the buddhas.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ ལ་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ སྡིག་པ འི་ གྲོགས་པོ འི་ ལག་ ཏུ་ སོང་བ་ ཡིན་ ཞིང་ དགེ་བ འི་ བཤེས་གཉེན་ གྱི་ ལག་ ཏུ་ སོང་བ་ མ་ ཡིན་ ལ །_
en: Śāradvatī­putra, when noble sons or daughters fall into the hands of evil companions and not into the hands of spiritual friends,

source: སྡིག་པ འི་ གྲོགས་པོ་ དེ་དག་ ལ་ ཡང་ སྟེན་པ ར་ བྱེད །_ |#| [191b] སྙེན་པ ར་ བྱེད །_ |#| བསྙེན་བཀུར་ བྱེད་ དེ །_
en: they will attend upon [191.b] , serve, and honor those evil companions; |#| and

source: དེ་ སྡིག་པ འི་ གྲོགས་པོ་ དེ་དག་ ལ་ བསྟེན་ ཅིང་ བསྙེན་ ལ་ བསྙེན་བཀུར་ བྱས་པ ས་ དེ་དག་ ཉིད་ ཀྱི་ རྗེས་སུ་ བསླབས་ ནས་ སྤོང་བ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: through so attending upon, serving, and honoring those evil companions, they will emulate them and thereby abandon awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ བདག་ ཏུ་ མངོན་པར་ ཞེན་པ ས་ དམིགས་པ་ ཅན་ ཡིན་ ཏེ །_
en: Moreover, Śāradvatī­putra, through strong attachment to self, bodhisattvas begin to perceive in terms of reference points, and then,

source: དེ་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཟབ་མོ་ དེ་ལྟ་ བུ་ དེ་དག་ ཐོས་ ནས །_
en: upon hearing such profound Dharma discourses,

source: སྐྲག་ ཅིང་ དངང་ ལ་ དངང་ བར་ འགྱུར་ ཞིང་ གཡང་ས་ ཆེན་པོ ར་ ཡང་ རབ་ཏུ་ ལྟུང་བ་ ཡིན་ ཏེ །_
en: they become terrified and out of fright jump off a very steep cliff;

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ ཆོས་ གཉིས་པ་ དེ་ དང་ ལྡན་ ན །_ |#| བྱང་ཆུབ་ སྤོང་བ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, sons and daughters of noble family with that second factor are made to abandon awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ རིགས་ ཀྱི་ བུ་ གཅེར་བུ་པ འི་ སྨྲ་བ་ ལ་ ཞུགས་པ་ ཡིན་ ཞིང་ །_ འཇིག་རྟེན་ རྒྱང་ ཕན་པ འི་ གསང་ཚིག་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ་ དང་ །_ སྐྱེ་བོ་ མང་པོ ས་ བཀུར་བ་ ཡིན་ ཏེ
en: Furthermore, Śāradvatī­putra, noble sons and daughters who follow the proponents of the nirgranthas, or who apply the spells of the materialists, may be respected by many people, and that being the case,

source: དེ འི་ ཆོས་ དེ་དག་ མི་ སེམས་པ ར་ སྤོང་བ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: they do not consider the qualities of the buddhas and so are made to abandon them.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ ཚུལ་ཁྲིམས་ འཆལ་པ་ དང་ །_ ཚུལ་ཁྲིམས་ རྒུད་པ་ ཡིན་ ཞིང་ །_ ཇི་ལྟ ར་ བསླབ་པ་ བཅས་པ་ ལ་ ཡང་ མི་སློབ་པ་ ཡིན་ ཏེ །_ |#| དེ་ཡོ་ བྱད་ བསྙུངས་པ འི་ གཏམ་ དང་ ལྡན་པ་ དེ་ལྟ་ བུ་ དེ་དག་ སྤོང་བ ར་ བྱེད་པ་ ཡིན་ ཞིང་ །_ གཤེ་བ ར་ བྱེད་ ལ་མོ ས་ པར་ མི་ བྱེད་ དེ །_
en: Furthermore, Śāradvatī­putra, bodhisattvas with perverted and degenerate discipline, who do not emulate those with proper training, abandon those who advocate austerity, criticize them, and have no devotion for them.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ ཆོས་ བཞི་པོ་ དེ་ དང་ ལྡན་ ན་ བྱང་ཆུབ་ སྤོང་བ ར་ བྱེད་པ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, noble sons or daughters with those four factors are made to abandon awakening.”

source: སྡིག་པ འི་ གྲོགས་ རྣམས་ སྟེན་ བྱེད་ ཅིང་ །_།
en: “Attending upon evil companions,

source: དེ་དག་ གི་ ནི་ རྗེས་ ཕྱོགས་ འགྱུར །_།
en: They will emulate them.

source: དེ་ཕྱིར་ ཆོས་ ནི་ སྤོང་ བྱེད་ ཅིང་ །_།
en: Thus abandoning the Dharma,

source: སངས་རྒྱས་ བྱང་ ཆུབ་ འདོད་ མི་ བྱེད །_།
en: They will not long for the Buddha’s awakening.

source: གཅེར་བུ འི་ སྨྲ་ དང་ འདྲེས་པ་ དང་ །_། འཇིག་རྟེན་ རྒྱང་ ཕན་སེམས་པ་ ཡིན །_།
en: $1522 “Having mingled with nirgrantha preachers And being inclined toward materialism,

source: བསྟན་པ་ འདི་ ནི་ བརྗོད་བྱ ས་ ཏེ །_།
en: When they explain this teaching

source: བློ་ངན་ དུས་ ནི་ དྲང་པོ་ ཡིན །_།
en: It will be the true time of unwholesome intellects.#76

source: བྱིས་པ་ མཁས་པ འི་ ང་རྒྱལ་ཅན །_། ཀྱེ་མ་ མཁས་པ ར་ རློམ་སེམས་ བྱེད །_།
en: $1523 “The immature will have the pride of the wise, And alas, have conceit that they are wise.

source: དེ་ཕྱིར་ དེ་ ནི་ ཆོས་ སྤངས་ ཤིང་ །_།
en: Thus abandoning the Dharma,

source: སངས་རྒྱས་ བྱང་ཆུབ་ འཚང་ མི་ རྒྱ །_།
en: They will not awaken to the buddhas’ awakening.

source: བདག་ ཏུ་ སྨྲ་བ་ གང་ཡིན་པ །_། དམིགས་པ་ ལ་ ནི་ གནས་ ནས་ སུ །_།
en: $1524 “While adhering to the perspective Of those that propound a self,

source: ཟབ་མོ འི་ ཆོས་ རྣམས་ ཐོས་ གྱུར་ ནས །_། |#| བློ་ངན་ ཆོས་ ནི་ སྤོང་བ ར་ བྱེད །_།
en: Hearing the profound Dharma Will lead fools to abandon the Dharma.

source: མཐའ་ འདས་ སྟོང་ཉིད་ ཇི་བཞིན་ དང་ །_། དོན་ ནི་ དེ་ ཡིས་ མི་ ཤེས་ ཏེ །_།
en: $1525 “They will not understand the significance Of emptiness beyond extremes, exactly as it is.

source: དེ་ཕྱིར་ བྱང་ཆུབ་ སྤོང་བ ར་ བྱེད །_།
en: They will therefore be made to abandon awakening.

source: དེ་ ཡི་ གཏིང་ ནི་ ཤེས་ མ་ [192a] ཡིན །_།
en: They will not understand its depths. [192.a]

source: ཚུལ་ཁྲིམས་ འཆལ་ དང་ སྡིག་ཆོས་ ཅན །_། མི་གཙང་ ཀུན་རྟོག་ སྤྱོད་ཡུལ་བ །_། ཇི་ལྟ ར་ བསླབ་པ་ བཅས་པ་ ལ །_། བློ་ངན་ དེ་དག་ སློབ་ མི་ བྱེད །_།
en: $1526 “With perverted discipline and wicked qualities, They will be leaders in indulging in unclean thoughts. |#| Those idiots will not train According to those with training.

source: དམུ་རྒོད་ བཀའ་བློ་ མི་ བདེ་བ །_། རྨ་ འབེབས་པོ་ དང་ ལྕེ་ ངན་པོ །_། དེ་ལྟ འི་ ཆོས་ཅན་ དེ་ ལ་ ནི །_། སྡིག་པ་ མི་ བྱེད་ ཅི་ཡང་ མེད །_།
en: $1527 “For those with such qualities As unruliness, disobedience, Hurtfulness, and a wicked tongue There is no evil deed that is off limits.

source: དེ་ཕྱིར་ དེ་ ནི་ རྣམ་པར་ སྤང་ །_། |#| རྟག་པ ར་ སངས་རྒྱས་ རྣམས་ ཀྱིས་ སྨད །_།
en: $1528 “Thus, abandon those things That are continually disparaged by the buddhas.

source: གང་དག་ ང་ ཡིས་ རྟག་ བསྔགས་པ འི །_། ཆོས་ ལ འང་ རྟག་ ཏུ་ བསྟེན་པ ར་ བྱ །_།
en: And continually rely upon the Dharma Which is always praised by me.

source: གང་ཞིག་ སངས་རྒྱས་ མཐོང་ འདོད་ དང་ །_། དེ་ འདྲ འི་ ཆོས་ ནི་ ཉན་ འདོད་ དེས །_། |#| ཚུལ་ཁྲིམས་ ཕུང་པོ་ ལེགས་ པ ར་ བརྟག _།
en: $1529 “Whoever wants to see buddhas, And listen to such Dharma, Should observe well the collected teachings on discipline—

source: དེ་ ལ་ ཆོས་ ནི་ འཐོབ་པ ར་ འགྱུར །_།
en: They will acquire the Dharma amidst that.

source: ཚུལ་ཁྲིམས་ ཕུང་པོ ར་ གང་དག་ གནས །_། |#| དེ་ ལ་ འཇུག་པ ར་ འདོད་པ་ དང་ །_། དེ་ ལ་ ཀུན་ ཏུ་ རྟོག་ འདོད་པ ས །_། དེ་ཕྱིར་ ཚུལ་ཁྲིམས་ བསྟེན་པ ར་ བྱ །_།
en: $1530 “Whoever wants to enter among, And consider themselves part of, Those who adhere to the collected teachings on discipline, Should therefore rely upon discipline.

source: ཡེ་ཤེས་ དེ་ འདྲ་ འཇུག་ འདོད་ ན །_།
en: $1531 “If they want to engage in such wisdom,

source: ཡིད་གཞུངས་པ་ ཡིས་ ཚུལ་ཁྲིམས་ བསྟན །_།
en: The broad-minded teach discipline.

source: བྱང་ཆུབ་ རྣམས་ ཀྱི་ ཕུལ་ དང་ མཆོག _། དེས་ ནི་ རྙེད་པ ར་ དཀའ་ མ་ ཡིན །_།
en: The highest and best of awakenings Will then not be difficult for them to attain.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ ཆོས་ བཞི་ དང་ ལྡན་ ན་ བྱང་ཆུབ་ ཀུན་ ཏུ་ བསྲུང་བ འི་ ཕྱིར་ ཞུགས་པ་ ཡིན་ ཏེ །_
en: $1532 “Śāradvatī­putra, there are four qualities that those who have perfectly embarked on the Great Vehicle will have if they have set out to guard awakening.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ ལ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་ པ་ ནི་ བདག་ཉིད་ ཀྱང་ ཚུལ་ཁྲིམས་ ཕུན་སུམ་ ཚོགས་པ་ ཡིན །_
en: Śāradvatī­putra, those who have perfectly embarked on the Great Vehicle are themselves excellent in discipline.

source: དགེ་བ འི་ ཆོས་ཅན་ དང་ །_ ཚུལ་ཁྲིམས་ ཀྱི་ ཕུང་པོ་ ལ་ ལེགས་པ ར་ རབ་ཏུ་ གནས་པ་ དང་ མང་ དུ་ ཐོས་པ་ ཡིན །_
en: They adhere to and are highly learned in virtuous qualities and the collected teachings on discipline.

source: དོན་དམ་པ་ ལ་ མཁས་ ཤིང་ འཇིག་རྟེན་ རྒྱང་ ཕན་པ་ དང་ ཡང་ མ་ འདྲེས་པ་ ཡིན །_
en: They are expert in the absolute and have not even associated with materialists.

source: སངས་རྒྱས་ ཀྱི་ བྱང་ཆུབ་ དག་པ་ ཡོངས་ སུ་ འཐོབ་ ཅིང་
en: They will attain the pure awakening of a buddha, and,

source: དབེན་པ་ ལ་ གཞོལ་བ ས་ དགོན་པ་ དང་ །_ རབ་ཏུ་ དགོན་པ་ ལ་ མངོན་པར་ དགའ་བ་ ཡིན་ ཏེ །_
en: being inclined toward solitude, they will delight in forests and wildernesses.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ ཆོས་ བཞི་པོ་ དེ་དག་ དང་ ལྡན་པ་ ནི་ བྱང་ཆུབ་ ཀུན་ ཏུ་ བསྲུང་བ འི་ ཕྱིར་ ཞུགས་པ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, those are the four qualities that those who have embarked on the Great Vehicle have when they have set out to guard awakening.”

source: ཚུལ་ཁྲིམས་ ཕུང་པོ ར་ དེ་ གནས་ ཀྱང་ །_།
en: “Despite adhering to the collected teachings on discipline,

source: ཚུལ་ཁྲིམས་ ཀྱིས་ ནི་ རློམ་སེམས་ མེད །_།
en: They are not conceited due to discipline.

source: ངེས་པ འི་ དོན་ དང་ ཟབ་མོ་ ཡི །_། ཆོས་ ནི་ ཕྱིས་ ཀྱང་ ཚོལ་ བར་ བྱེད །_།
en: They will continue to pursue the Dharma, Which is profound and of definitive meaning.

source: སངས་རྒྱས་ བྱང་ཆུབ་ དག་པ་ དང་ །_། རྣམ་དག་ ཡོངས་སུ་ དག་པ འང་ ཚོལ །_།
en: $1534 “They will also pursue the awakening of a buddha, Which is pure, fully pure, and completely pure. [192.b]

source: གཅེར་བུ་ རྣམས་ [192b] ཀྱིས་ གང་ འཛིན་པ འི །_། གསང་ཚིག་ དག་ ནི་ དེ་ མི་ ཚོལ །_།
en: They will not pursue the spells That are upheld by the nirgranthas.

source: འཐབ་ མེད་ གསང་ཚིག་ དེ་ འདོད་པ ས །_། འཇིག་རྟེན་ རྒྱང་ ཕན་ འདྲེས་མ་ ཡིན །_།
en: $1535 “Those who want the spells that are free of conflict Do not associate with materialists.

source: སངས་རྒྱས་ ཆོས་ ལ་ ངེས་ ཡིན་ ཞིང་ །_། རྟག་ ཏུ་ བསྟན་པ་ སྲུང་བ ར་ བྱེད །_།
en: They ascertain the qualities of the buddhas And guard the teaching constantly.

source: གང་དག་ གིས་ ནི་ སེམས་ འཁྲུག་པ འི །_། བུད་མེད་ རྣམས་ ནི་ དེར་ མི་ འགྲོ །_། |#| དབེན་པ་ ཞི་བ་ སྟོང་པ་ ཡི །_། བས་མཐ འི་ དགོན་པ་ རྣམས་ སྟེན་ བྱེད །_།
en: $1536 “Those that do not cavort with women, Whose minds are disturbed, Take the support of the outlying forests, Which are empty, tranquil, and uninhabited.

source: ང་ ཡིས་ མཆོག་ དང་ ཕུལ་ བསྔགས་པ འི །_། ཆོས་ བཞི་པོ་ ནི་ དེ་དག་ དང་ །_། བྱང་ཆུབ་ རྣམས་ ཀྱི་ དོན་ གང་ བསྟན །_། |#| ཆོས་ དེ་དག་ ལ་ བསྟེན་པ ར་ བྱོས །_།
en: $1537 “Rely on those four qualities, Which I have praised as supreme and highest, And upon those teachings That show the meaning of awakening.

source: དེ་ དང་ དེར་ ནི་ དེ་བཞིན་ དུ །_། སྔོན་ ཆད་ དེ་དག་ བསྟེན་པ་ ཡིན །_།
en: $1538 “In many different places in the past They were relied upon as well.

source: ཡེ་ཤེས་ ཀུན་ ཏུ་ སྲུང་བ ར་ བྱེད །_།
en: They fully guard wisdom—

source: དེས་ ནི་ ང་ ཡི་ ཡེ་ཤེས་ བསྒྲུབས །_།
en: Through them my wisdom was accomplished.

source: ཆོས་ ནི་ ཀུན་ ཏུ་ བསྲུང་ བྱས་པ ས །_། འགྲོ་བ་ ངན་པ ར་ འགྲོ་ མི་ འགྱུར །_།
en: $1539 “By fully guarding the Dharma, You will not migrate to negative destinies.

source: རྟག་པ ར་ དེ་ ཞི་ ཀུན་ ཏུ་ དག _།
en: Always tranquil and pristine,

source: གཟུགས་ ཀྱིས་ ཀྱང་ ནི་ འཕགས་པ ར་ འགྱུར །_།
en: You will be exalted even in form.

source: ལོངས་སྤྱོད་ ལྡན་པ ར་ དེ་ རྟག་ འགྱུར །_།
en: $1540 “They will always be in possession of wealth,

source: ཐོབ་ ནས་ ཀྱང་ ནི་ བག་ ཡོད་ འགྱུར །_།
en: But having acquired it, they will be circumspect.

source: དེ་ ལ་ སྙིང་པོ་ སྟོན་པ ར་ འགྱུར །_། |#| ལོངས་སྤྱོད་ རྣམས་ ནི་ མི་རྟག་ ཅེས །_།
en: They will point out its essence, Saying, ‘Wealth is impermanent.’

source: གང་ བྱིན་ དེ་ ནི་ ང་ ཡི་ ཡིན །_།
en: $1541 “Whatever you give is yours to keep;

source: གང་ མ་ བྱིན་ དེ་ ང་ ཡི་ མིན །_།
en: Whatever you keep you lose.

source: ང་ དང་ ལོངས་སྤྱོད་ ཕུང་པོ འང་ རུང་ །_། |#| ཐམས་ཅད་ སྤངས་ ནས་ སོང་བ་ ཡིན །_།
en: Both you and your amassed wealth Have come from abandoning everything.

source: གཡོག་འཁོར་ བཟང་པོ ར་ འགྱུར་བ་ ཡིན །_། |#| དེ་ ཡི་ བཤེས་གཉེན་ བཟང་པོ ར་ འགྱུར །_།
en: $1542 “They will obtain a fine retinue of attendants, And will act as their fine spiritual friends.

source: སངས་རྒྱས་ ཀྱིས་ ནི་ བསྔགས་ ཆོས་ ལ །_། མ་ ཡེང་ ངེས་པ ར་ སྦྱོར་བ ར་ འགྱུར །_།
en: They will unequivocally connect With the qualities praised by the buddhas.

source: བདག་ཉིད་ ཀྱིས་ ཀྱང་ འདུན་པ་ ཡིན །_། |#| གཞན་ ཡང་ དེ་ ལ་ ངེས་ སྦྱོར་བྱེད །_།
en: $1543 “They will aspire for such qualities themselves, And resolutely connect others with them too.

source: དེ་ཕྱིར་ དེ་ ནི་ དགའ་བ་ འཐོབ །_། |#| དམ་པ འི་ ཆོས་ ཀྱང་ སྤྱོད་ པ ར་ འགྱུར །_།
en: They will thus acquire joy, And practice the sublime Dharma.

source: གང་དག་ འཇིག་རྟེན་ མཆོག་ བཀུར་བ འི །_། རིགས་ མཐོ་བ ར་ ཡང་ རྟག་པ ར་ སྐྱེ །_། |#| དེ་ ནི་ བག་མེད་ མི་ བྱེད་ ཅིང་ །_། རྟག་ ཏུ་ ཆོས་ ལ་ སྟེན་པ ར་ བྱེད །_།
en: $1544 “They will always be born to a prominent caste, Respected as supreme in the world, And will not act heedlessly, But rely continually on the Dharma.

source: རྫོགས་ སངས་རྒྱས་ ལ་ མཉེས་ བྱེད་ འགྱུར །_།
en: $1545 “They will please the perfect buddhas.

source: མཐོང་ ནས་ ཀྱང་ ནི་ དད་པ ར་ བྱེད །_།
en: Upon seeing them they will be inspired.

source: སེམས་ དད་ ཅིང་ ནི་ ཡིད་ དགའ་ ནས །_། |#| མཆོད་པ་ དམ་པ་ བྱེད་པ ར་ འགྱུར །_།
en: Devout and joyous, They will make sublime offerings.

source: ལུས་ དང་ སྲོག་ དང་ ལོངས་སྤྱོད་ ནི །_། དེ་དག་ ཐམས་ཅད་ སྙིང་པོ་ མེད །_།
en: $1546 “Body, life force, and wealth— They are all without essence.

source: སྐྱེས་བུ་ དམ་པ་ མཐོང་ ནས་ ཀྱང་ །_།
en: Upon seeing sublime beings,

source: མྱུར་ དུ་ སྙིང་པོ་ སྟོན་པ ར་ འགྱུར །_།
en: They will instantly teach the essence.

source: དེ་ ཡི་ ལུས་ དང་ ལོངས་སྤྱོད་ ལ འང་ །_། སྙིང་པོ འི་ འདུ་ཤེས་ འཇུག་ མི་ འགྱུར །_།
en: $1547 “They will not entertain the idea That their bodies and wealth have any essence. [193.a]

source: སངས་རྒྱས་ [193a] རྣམས་ ནི་ འབྱུང་བ་ དཀོན །_།
en: It is rare for buddhas to appear, And

source: དལ་བ་ དེ་ འདྲ་ འང་ རྙེད་པ ར་ དཀའ །_།
en: such leisures too are difficult to acquire.

source: དེར་ ནི་ དལ་བ འང་ འཐོབ་ འགྱུར་ ཞིང་ །_།
en: $1548 “They will also acquire the leisures there, And

source: ཐོབ་ ནས་ ཀྱང་ ནི་ ཡིད་ མི་ འབྱུང་ །_།
en: upon acquiring them, they will not be discouraged.

source: གང་ ལས་ ཡེ་ཤེས་ འཐོབ་ འགྱུར་བ འི །_། མངོན་ འབྱུང་ དེ་ ལ་ སྟེན་པ ར་ བྱེད །_།
en: They will rely on going forth, The source from which wisdom is attained.

source: རངས་ དང་ མཆོག་ ཏུ་ དགའ་ བསྐྱེད་ ནས །_། |#| ཡེ་ཤེས་ དམ་པ་ ཚོལ་ བར་ བྱེད །_།
en: $1549 “Elated and ecstatic, They will pursue sublime wisdom.

source: གང་ ལས་བྱང་ ཆུབ་ འཐོབ་ འགྱུར་བ འི །_། ཆོས་ ལ འང་ རྟག་པ ར་ གནས་པ ར་ བྱེད །_།
en: They will also continually adhere to the Dharma, The source from which awakening is attained.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ ཆོས་ བཞི་ དང་ ལྡན་ ན་ བདག་ཉིད་ ཀྱིས་ བདག་ཉིད་ དབུགས་ འབྱིན་ ཅིང་ མཆོག་ ཏུ་ དགའ་བ་ སྐྱེས་ ནས་ ཀྱང་ གནས་པ ར་ བྱེད་ དོ །_།
en: $1550 “Śāradvatī­putra, there are four qualities that will encourage and delight those who have perfectly embarked on the Great Vehicle, thus rendering them steadfast.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ ལ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་ ནས་
en: Śāradvatī­putra, having perfectly embarked on the Great Vehicle,

source: ལོངས་སྤྱོད་ ཀྱི་ ཕུང་པོ འི་ བདོག་པ་ ཐམས་ཅད་ ཡོངས་སུ་ གཏོང་བ་ ཡིན །_
en: they discard all their possessions and wealth.

source: ཚུལ་ཁྲིམས་ ཀྱི་ ཕུང་པོ འི་ ཡོན་ཏན་ ཐམས་ཅད་ ལ་ རབ་ཏུ་ གནས་པ་ ཡིན །_
en: They adhere to all the qualities of the collected teachings on discipline.

source: ཆོས་ ཟབ་མོ་ རྣམས་ ཀྱིས་ ཡེ་ཤེས་ ཐམས་ཅད་ མངོན་དུ་ འཕགས་ པ་ ཡིན་ ཞིང་ མངོན་དུ་ འཕགས་ ནས་
en: Due to their profound qualities all their wisdoms are exalted, and being so exalted,

source: ལུས་ དང་ སྲོག་ གཏོང་བ ར་ བྱེད་ ཀྱང་ ཆོས་ གཏོང་བ ར་ མི་ བྱེད་པ་ ཡིན །_
en: they do not abandon the Dharma, even at the cost of life and limb.

source: དགེ་སློང་ ཆོས་ སྨྲ་བ་ དམ་པ འི་ ཆོས་ ཡོངས་སུ་ འཛིན་པ་ མདོ་སྡེ་ དེ་ལྟ་ བུ་ འཛིན་པ་ རྣམས་ ལ་ ཡང་ བདེ་བ འི་ ཡོ་བྱད་ ཐམས་ཅད་ ཀྱིས་ སྤྲོ་བ ར་ བྱ་བ་ ལ་ ཞུགས་པ་ ཡིན་ ཏེ །_
en: They also offer pleasing necessities to all monks who preach the Dharma, who receive the sublime Dharma, and who uphold such sūtras.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ ཆོས་ བཞི་པོ་ དེ་དག་ དང་ ལྡན་ ན་ བདག་ཉིད་ ཀྱིས་ བདག་ཉིད་ ལུང་སྟོན་པ་ དང་ །_ དབུགས་ འབྱིན་པ་ མང་བ་ ཡིན་ ནོ །_།
en: Śāradvatī­putra, if those who have perfectly embarked on the Great Vehicle have those four qualities they will predict and confirm themselves abundantly.”

source: ལོངས་སྤྱོད་ རྣམས་ ནི་ ཀུན་ བགེད་ བྱེད །_། |#| ཚུལ་ཁྲིམས་ ཕུང་པོ ར་ ཤིན་ཏུ་ གནས །_།
en: “They distribute all enjoyments, And perfectly adhere to the collected teachings on discipline.

source: ཆོས་ རྣམས་ ལ་ ནི་ མངོན་དུ་ འཕགས །_།
en: Exalted in all teachings,

source: སྟོང་པ འི་ ཆོས་ ལ་ ཐེ་ཚོམ་ མེད །_།
en: They have no doubt about the Dharma of emptiness.

source: གང་དག་ ཆོས་ ནི་ སྟོན་པ་ ཡི །_། ཆོས་ དེ་ཡང་ ནི་ ཡོངས་སུ་ འཛིན །_།
en: $1552 “They receive the Dharma Of those who teach the Dharma.

source: གང་དག་ ཆོས་ ནི་ སྟོན་པ་ ལ འང་ །_། བདེ་བ ར་ སྒྲུབ་པ ས་ ཞུགས་པ་ ཡིན །_།
en: They also engage those who teach the Dharma By providing for their happiness.

source: དེ་ཕྱིར་ དེ་ ནི་ དགའ་བ་ འཐོབ །_། |#| མཆོག་ ཏུ་ དགའ་བ འང་ དེ་ ཡིས་ འཐོབ །_།
en: $1553 “They will thus acquire joy, And then acquire supreme joy.

source: མི་མཆོག་ སངས་རྒྱས་ འགྱུར་བ ར་ ནི །_། བདག་ཉིད་ ལ་ ཡང་ ལུང་ སྟོན་ ཏོ །_།
en: They will also predict themselves To become buddhas, supreme humans.

source: དེ་ ལ་ སངས་རྒྱས་ ལུང་ སྟོན་ མཛད །_། |#| གང་དག་ འདས་ དང་ མ་ བྱོན་ དང་ །_། གང་དག་ བྱུང་བ འི་ རྫོགས་ སངས་རྒྱས །_། དེ་དག་ རྒྱལ་བ ར་ ལུང་ ཡང་ སྟོན །_།
en: $1554 “They will be prophesied by the buddhas, The fully awakened ones Of the past, future, and present. |#| Thus they predict them to become victorious ones. [193.b]

source: སངས་རྒྱས་ ཐེག་པ་ [193b] བླ་མེད་ ཀྱི །_། བྱང་ཆུབ་ ལམ་ ལ་ དེ་ གནས་ ཤིང་ །_།
en: $1555 “Adhering to the path to awakening Of the unexcelled vehicle of the buddhas,

source: སངས་རྒྱས་ རྣམས་ ཀྱིས་ གང་ བསྟེན་པ འི །_། ཆོས་ དེ་དག་ ལ འང་ སྟེན་པ ར་ བྱེད །_།
en: They will also rely on the Dharma Upon which the buddhas have relied.

source: སངས་རྒྱས་ རྣམས་ ཀྱིས་ དེ་དག་ བསྔགས །_། |#| བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱིས་ བསྟེན །_།
en: $1556 “Bodhisattvas rely Upon those things praised by the buddhas.

source: སངས་རྒྱས་ ལམ་ ནི་ བླ་མེད་ ཀྱི །_། ལམ་ དེ་ ལ་ ནི་ དེ་ གནས་འགྱུ ར །_།
en: They will adhere to the path, The unexcelled path to awakening.

source: ཇི་ལྟ ར་ ནམ་མཁ འི་ ལམ་ དུ་ ནི །_། སྣོད་ གཅིག་ བོར་བ ར་ གྱུར་པ་ དང་ །_། ཇི་ལྟ ར་ ཆགས་པ ར་ བལྟ་ བྱ་ དང་ །_། དེ་ ཡི་ གནས་པ་ ཡོད་ མིན་ བཞིན །_། དེ་ལྟ ར་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡིས །_། གང་ བསླབས་ བྱང་ཆུབ་ ལམ་ ལ་ ཡང་ །_། བྱང་ཆུབ་ མ་ ཐོབ་ བར་ དུ་ ནི །_། དེ་ ཡི་ ལྡོག་པ་ ཡོད་ མ་ ཡིན །_།
en: $1557 “When a vessel Is tossed into the sky, It does not become suspended And has no stationary position.#77 |#| $1558 “Likewise do bodhisattvas Never turn back On the path to awakening in which they train Until they attain awakening.

source: ཇི་ལྟ ར་ ཀུན་ ཏུ་ འདྲེས་པ་ དེར །_། གདམས་པ་ སྐྱེད་པ ར་ བྱེད་པ་ ཡང་ །_། དེ་ ཡི་ རྒྱུན་ ཆད་ ཡོད་ མ་ ཡིན །_། |#| མྱུར་ དུ་ དེ་ ནི་ འཛུད་པ ར་ བྱེད །_།
en: $1559 “Just as when instructions Are imparted to a crowd, And it is not disbanded, But swiftly enlisted,

source: དེ་བཞིན་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ །_། རྟག་ ཏུ་ ཆོས་ རྣམས་ སྟེན་ བྱེད་ ཀྱང་ །_། བྱང་ཆུབ་ སངས་ མ་ རྒྱས་ ཀྱི་ བར །_། བརྩོན་འགྲུས་ སྤོང་བ ར་ བྱེད་ མ་ ཡིན །_།
en: $1560 “Likewise do bodhisattvas, Even while relying perpetually on the Dharma, Never abandon diligence Until awakening to buddhahood.

source: ཇི་ལྟ ར་ ལྗོན་ཤིང་ རྩ་བ་ ཡང་ །_། མི་ ཡིས་ རྟག་པ ར་ སྦེད་བྱེད་ ཅིང་ །_། དུས་ སུ་ དཀྲི་བ ར་ བྱེད་པ་ ཡི །_། ཤིང་ ནི་ འཕེལ་བ ར་ འགྱུར་བ་ ཡིན །_།
en: $1561 “A tree will grow, Even when its roots Are constantly moved by people And occasionally entwined.

source: རླུང་ དང་ ཉི་མ་ དག་ གིས་ ནི །_། དུས་ སུ་ གྲང་ དང་ དྲོ་ གྱུར་པ ར །_། མཐར་གྱིས་ སྦ་བ་ བྱས་ ནས་ སུ །_། མེ་ ཏོག་ འབྲས་བུ་ དེ་དེ ས་ འབྱིན །_།
en: $1562 “Even though it is cold and hot, according to season, Due to wind and sun, Its roots are eventually buried, And the tree yields flowers and fruit.

source: སེམས་ཅན་ མང་ ལ་ བདེ་བྱེད་པ །_། ཤིང་ གི་ གྲིབ་མ་ ཡིད་ དགའ་ འབྱུང་ །_། |#| བདེ་བ འི་ བདེ་ དང་ ལྡན་པ་ དག _། |#| མེ་ཏོག་ འབྲས་བུ་ ལོངས་ ཀྱང་ སྤྱོད །_།
en: $1563 “Thus, it provides delightful shade That pleases many beings, Who can enjoy the bounty of flowers and fruits, Filled with happy delight.

source: དེ་བཞིན་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡང་ །_། བྱང་ཆུབ་ ཕྱིར་ ནི་ སེམས་བསྐྱེད་ ནས །_། |#| དུས་ སུ་ ཆོས་ རྣམས་ སྟེན་ བྱེད་ ཅིང་ །_། དུས་ སུ་ ཡོངས་སུ་ འདྲི་བ ར་ བྱེད །_།
en: $1564 “Likewise do bodhisattvas Engender the mind set on awakening, Then rely upon the Dharma, in a timely manner, And ask questions about it, in a timely manner.

source: དུས་ དང་ དུས་ མིན་ སྟེན་ བྱེད་ ཅིང་ །_། དུས་ དང་ དུས་ མིན་ འདྲི་བ ར་ བྱེད །_། |#| དུས་ སུ་ བརྩོན་འགྲུས་ རྩོམ་ བྱེད་ ཅིང་ །_། དེས་པ ས་ དུས་ སུ་ སྦྱིན་པ་ སྦྱིན །_།
en: $1565 “They serve others at all times, Ask questions at all times, Make effort in a timely manner, And gently practice generosity, according to season.

source: དུས་ སུ་ བྱང་ཆུབ་ སྙིང་པོ་ ཡི །_། ཤིང་ གི་ དྲུང་ དུ་ འདུག་ ནས་ སུ །_། བློ་གྲོས་ ངན་པ འི་ བདུད་ བཅོམ་ སྟེ །_། |#| དུས་ སུ་ བྱང་ཆུབ་ འཚང་ ཡང་ རྒྱ །_།
en: $1566 “They take their seat at the trunk of a tree, At the seat of awakening, in a timely manner, Destroy the wicked Māra, And awaken to buddhahood, in a timely manner.

source: འཇིག་རྟེན་ དུ་ ནི་ མ་ བསྐོར་བ འི །_། འཁོར་ལོ་ དུས་ སུ་ སྐོར་བ ར་ བྱེད །_།
en: $1567 “In a timely manner they turn the wheel, Which has not been turned in the world.
